Repository: gflohr/qgoda
Catalog: po/*.po
Languages: de_ch

source: not overwriting '{file}' without '--force'
de_ch: Datei «{file}» wird ohne «--force» nicht überschrieben

source: This can lead to malfunctions.
de_ch: Dies kann zu Fehlfunktionen führen.

source: Please merge '_config.new.yaml' manually!
de_ch: «_config.new.yaml» muss von Hand aktualisiert werden!

source: cannot write '{filename}': {error}
de_ch: Fehler beim Schreiben von «{filename}»: {error}

source: cannot read '{filename}': {error}
de_ch: Fehler beim Lesen von «{filename}»: {error}

source: force reload of configuration
de_ch: Neuladen der Konfiguration erzwingen

source: copying files
de_ch: Kopieren von Dateien

source: option '--force' given, will overwrite files
de_ch: Option «--force» angegeben; Dateien werden überschreiben

source: option '--force' given twice, will overwrite precious files
de_ch: Option «--force» zweimal angegeben, wertvolle Dateien werden überschreiben

source: but will preserve precious files, give '--force' twice to overwrite
de_ch: aber wertvolle Dateien werden bewahrt (zweimal «--force» erzwingt Überschreiben)

source: will preserve files, use '--force' to overwrite
de_ch: wertvolle Dateien werden bewahrt, «--force» erzwingt Überschreiben

source: create directory '{dir}'
de_ch: Erzeuge Verzeichnis «{dir}»

source: cannot create '{dir}': {error}
de_ch: Verzeichnis «{dir}» kann nicht erzeugt werden: {error}

source: not overwriting precious '{file}' without '--force --force'
de_ch: wertvolle Datei «{file}» wird ohne «--force --force» nicht überschrieben

source: copy '{src}' to '{dest}'
de_ch: Kopieren von «{src}» nach «{dest}»

source: cannot copy '{src}' to '{dest}': {error}
de_ch: Fehler beim Kopieren von «{src}» nach «{dest}»: {error}

source: Cannot setup asset processing.
de_ch: Fehler beim Einrichten der Asset-Verarbeitung.

source: updating 'package.json'
de_ch: Aktualisieren von «{package.json}»

source: cloning repository '{repository}'
de_ch: Klone Repository «{repository}»

source: deleting '{directory}'
de_ch: lösche «{directory}»

source: error deleting '{file}': {error}
de_ch: Fehler beim Löschen von «{file}»: {error}

source: giving up after previous errors
de_ch: gebe auf wegen vorhergehender Fehler

source: error copying '{src}' to '{dest}': {error}
de_ch: Fehler beim Kopieren von «{src}» in «{dest}»: {error}

source: error extracing '{archive}' to '{destination}': {error}
de_ch: Fehler beim Auspacken von «{archive}» in «{destination}»: {error}

source: error reading directory '{directory}': {error}
de_ch: Fehler beim Lesen des Verzeichnisses «{directory}»: {error}

source: archive '{archive} is empty
de_ch: Archiv '{archive} ist leer

source: archive '{archive}' has ambiguous content, trying first entry '{first}''
de_ch: Archiv «{archive}» hat keinen eindeutigen Inhalte, versuche den ersten Eintrag «{first}»'

source: downloading '{uri}' with lwp-perl
de_ch: Download von «{uri}» mit lwp-perl

source: error downloading '{uri}': {error}
de_ch: Fehler beim Download von «{uri}»: {error}

source: error including '{path}': {error}.
de_ch: Fehler beim Einbinden von «{path}»: {error}.

source: invalid filters '{filters}' (use named arguments!)
de_ch: Ungültige Filterdefinition «{filters}» (benannte Argumente verwenden!)

source: named arguments for '{method}()' are mandatory
de_ch: benannte Argumente für «{method}()» sind obligatorisch

source: method '{method}' requires named arguments, not '{args}'
de_ch: die Methode «{method}» erfordert benannte Argumente, nicht «{args}»

source: invalid arguments '{args}' for method '{method}()' (use named arguments!)
de_ch: Ungültige Argumente «{args}» für die Methode «{method}()» (benannte Argumente verwenden!)

source: successfully built '{location}'
de_ch: «{location}» erfolgreich erstellt

source: the argument 'location' is mandatory for clone()
de_ch: Das Argument «location» ist für clone() obligatorisch.

source: loadJSON('{filenname}'): absolute paths are not allowed!
de_ch: loadJSON(«{filenname}»): absolute Pfade sind nicht erlaubt!

source: '{filenname}'): '{updir}' is not allowed!
de_ch: «{filenname}»): «{updir}» ist nicht zulässig

source: error changing working directory to '{dir}': {error}
de_ch: Fehler beim Wechsel des Arbeitsverzeichnisses nach «{dir}»: {error}

source: the Qgoda top-level source directory (defaults to '..')
de_ch: das Qgoda-Wurzelverzeichnis (Vorgabewert ist «..»)

source: config file '_config.yaml' not found, proceeding with defaults.
de_ch: Konfigurationsdatei «_config.yaml» nicht gefunden, fahre mit Vorgabewerten fort.

source: reading configuration from '{filename}'
de_ch: lese Konfiguration aus «{filename}»

source: reading local configuration from '{filename}'
de_ch: lese lokale Konfiguration aus «{filename}»

source: lingua not set
de_ch: lingua nicht gesetzt

source: removing markdown file '{filename}'
de_ch: lösche Markdown-Datei «{filename}»

source: adding markdown file '{filename}'
de_ch: füe Markdown-Datei «{filename}» zu

source: creating asset object for '{filename}'
de_ch: erzeue Asset-Objekt für «{filename}»

source: DST
de_ch: SZ

source: Field '{field}' missing in 'package.json'.
de_ch: Feld '{field}’ fehlt in «package.json».

source: Invalid module name '{name}'.
de_ch: Unzulässiger Modulname «{name}».

source: Invalid entry point '{entry}'.
de_ch: Unzulässiger Einstiegspunkt («entry») «{entry}».

source: skipping draft '{relpath}'
de_ch: überspringe Entwurf «{relpath}»

source: skipping future document '{relpath}'
de_ch: überspringe Dokument mit Datum in der Zukunft «{relpath}»

source: {filename}: cannot parse date '{date}'
de_ch: {filename}: kann Datum «{date}» nicht parsen

source: cannot stat '{filename}': {error}
de_ch: Fehler beim Ermitteln der Dateiinformationen für «{filename}»: {error}

source: no front matter
de_ch: keine Titelei (Front Matter)

source: error reading front matter from '{filename}': {error}
de_ch: Fehler beim Lesen der Titelei (Front Matter) aus «{filename}»: {error}

source: no body found
de_ch: kein Inhalt (Body) gefunden

source: error reading body from '{filename}': {error}
de_ch: Fehler beim Lesen des Inhalts (Body) aus «{filename}»: {error}

source: template file '{path}' is not under version control
de_ch: Template-Datei «{path}» ist nicht unter Versionskontrolle

source: Processor class '{class}' does not implement the method process().
de_ch: Die Prozessorklasse «{class}» implementiert die Methode process() nicht.

source: no command given!
de_ch: kein Kommando angegeben!

source: invalid command name '{command}'
de_ch: unzulässier Kommandoname «{command}»

source: unknown command '{command}'
de_ch: unbekanntes Kommando «{command}»

source: Usage: {program} COMMAND [OPTIONS]
de_ch: Syntax: {program} KOMMANDO [OPTIONEN]

source: Mandatory arguments to long options, are mandatory to short options, too.
de_ch: Notwendige Argumente für Optionen in Langform sind auch für die Kurzform notwendig. Dies gilt in gleicher Weise für optionale Argumente.

source: The following commands are currently supported:
de_ch: Die folgenden Kommandos werden derzeit unterstützt:

source: Try '{program} --help' for more information or visit http://www.qgoda.net/en/docs/ for extensive documentation.
de_ch: Versuche «{program} --help» für weitere Informationen oder besuche http://www.qgoda.net/de/docs/für umfangreiche Dokumentation.

source: Usage: {program} [GLOBAL_OPTIONS] {usage} Try '{program} {command} --help' for more information!
de_ch: Syntax: {program} [GLOBAL_OPTIONS] {usage} Versuche « {programm} {command} --help» für weitere Informationen!

source: Usage: {program} [GLOBAL_OPTIONS] {command} [OPTIONS] Try '{program} {command} --help' for more information!
de_ch: Syntax: {program} [GLOBAL_OPTIONS] {command} [OPTIONS] Versuche «{programm} {command} --help» für weitere Informationen!

source: Usage: {program} [GLOBAL_OPTIONS] COMMAND [OPTIONS] Try '{program} --help' for more information!
de_ch: Syntax: {program} [GLOBAL_OPTIONS] COMMAND [OPTIONS] Versuche «{program} --help» für weitere Informationen!

source: {program} (Qgoda static site generator) {version} Copyright (C) {years} Cantanea EOOD (http://www.cantanea.com/). License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law. Written by Guido Flohr (http://www.guido-flohr.net/).
de_ch: {program} (Qgoda static Site Generator) {version} Copyright (C) {years} Cantanea EOOD (http://www.cantanea.com/). Lizenz GPLv3 +: GNU GPL Version 3 oder höher <http://gnu.org/licenses/gpl.html> Dies ist freie Software: Sie sind frei zu ändern und zu verteilen. Es gibt keine Garantie, soweit gesetzlich zulässig. Geschrieben von Guido Flohr (http://www.guido-flohr.net/).

source: invalid regular expression in filter: {error}
de_ch: Ungültiger regulärer Ausdruck im Filter: {error}

source: processing asset '/{relpath}'
de_ch: verarbeite Asset «/{relpath}»

source: not wrapping virtual asset '/{relpath}'
de_ch: virtuelles Asset «/{relpath}» wird nicht gewrappt

source: wrapping asset '/{relpath}'
de_ch: Asset «/{relpath}» wird gewrappt

source: one artefact has not been built because of errors (see above)
de_ch: ein Artefakt wurde aufgrund von Fehlern nicht erzeugt (siehe oben)

source: Overwriting artefact at '{outpath}', origin: {origin}
de_ch: Überschreiben von Artefakt «{outpath}», Ursprung: {origin}

source: [unknown origin]
de_ch: [unbekannte Herkunft]

source: Skipping unchanged file '{output}'
de_ch: Unveränderte Datei «{output}» wird übersprungen

source: error writing '{filename}': {error}
de_ch: Fehler beim Schreiben von «{filename}»: {error}

source: processing with {processor}
de_ch: Verarbeitung mit {processor}

source: no view specified.
de_ch: kein View angegeben.

source: no default view '{file}', creating one with defaults.
de_ch: erzeuge Standardview «{file}» mit Vorabewerten.

source: This view has been automatically created. Please edit '{path}' to your needs!
de_ch: Diese View-Datei wurde automatisch erstellt. Bitte «{path}» nach den eigenen Bedürfnissen bearbeiten!

source: error writing view '{file}': {error}.
de_ch: Fehler beim Schreiben der View-Datei «{file}»: {error}.

source: error reading view '{file}': {error}.
de_ch: Fehler beim Lesen der View-Datei «{file}»: {error}.

source: wrapping with {processor}
de_ch: wrappe mit {processor}

source: initializing plug-ins.
de_ch: Initialisieren der Plug-ins.

source: cannot open directory '{dir}': {error}!
de_ch: Verzeichnis «{dir}» kann nicht geöffnet werden: {error}!

source: initializing plugin {name}.
de_ch: Initialisieren der Plug-Ins {name}..

source: error reading plugin package file {file}: {error}!
de_ch: Fehler beim Lesen der Plug-In-Paketdatei {file}: {error}!

source: {file}: plugin definition (key 'qgoda') missing!
de_ch: {file}: Plug-In-Definition (Schlüssel «qgoda») fehlt!

source: {file}: value for key 'qgoda' must be a dictionary!
de_ch: {file}: Wert für Schlüssel «qgoda» muss ein Dictionary (Hash) sein!

source: {file}: 'qgoda.main' or 'main' must point to main source file!
de_ch: {file}: «qgoda.main» oder «main» muss auf die Hauptquelldatei zeigen!

source: {file}: language (qgoda.language) missing!
de_ch: {file}: Sprache (qgoda.language) fehlt!

source: {file}: unsupported language '{language}'!
de_ch: {file}: nicht unterstützte Sprache «{language}»!

source: {file}: type (qgoda.type) missing!
de_ch: {file}: Typ (qgoda.type) fehlt!

source: {file}: unsupported plugin type '{type}'!
de_ch: {file}: nicht unterstützter Plug-In-Typ «{type}»!

source: fetching '{uri}'
de_ch: hole «{uri}»

source: created temporary directory '{dir}'
de_ch: temporäres Verzeichnis «{dir}» erstellt

source: option '--watch' is not supported, use '{program} watch' instead!'
de_ch: Option «--watch» wird nicht unterstützt, verwende stattdessen «{program}» watch'!

source: no target specified
de_ch: kein Ziel angegeben

source: only one target may be specified
de_ch: Es kann nur ein Ziel angegeben werden.

source: configuration variable 'po.textdomain' not set
de_ch: Konfigurationsvariable «po.textdomain» nicht gesetzt

source: configuration variable 'linguas' not set or empty
de_ch: Konfigurationsvariable «linguas» nicht gesetzt oder leer

source: cannot get current working directory: {error}
de_ch: das aktuelle Arbeitsverzeichnis kann nicht ermittelt werden: {error}

source: cannot change directory to '{directory}': {error}
de_ch: Verzeichnis kann nicht in «{directory}» geändert werden: {error}

source: unsupported target '{target}'
de_ch: nicht unterstütztes Ziel «{target}»

source: checking for missing files in po directory
de_ch: Überprüfung auf fehlende Dateien im po-Verzeichnis

source: creating '{filename}'
de_ch: Erstellen von «{filename}»

source: error creating directory '{directory}': {error}
de_ch: Fehler beim Erstellen des Verzeichnisses «{directory}»: {error}

source: Makefile snippet holding package-dependent information. Please adhere to Makefile syntax!
de_ch: Makefile-Schnipsel, der paketabhängige Informationen enthält. Bitte Makefile-Syntax einhalten!

source: Space-separated list of language codes. Omit the base language!
de_ch: Durch Leerzeichen getrennte Liste von Sprachcodes. Die Basissprache weglassen!

source: Textdomain of the site, for example reverse domain name.
de_ch: Textdomain der Website, z. b. umgekehrter Domain-Name.

source: Where to send msgid bug reports?
de_ch: Wohin können msgid-Bug-Reports geschickt werden?

source: Please set MSGID_BUGS_ADDRESS in 'PACKAGE'
de_ch: Bitte MSGID_BUGS_ADDRESS in «PACKAGE» setzen

source: Initial copyright holder added to pot and po files.
de_ch: Der ursprüngliche Copyright-Inhaber wurde in pot-und po-Dateien zugefügt.

source: Please set COPYRIGHT_HOLDER in 'PACKAGE'
de_ch: Bitte COPYRIGHT_HOLDER in «PACKAGE» setzen

source: Override these default values as needed.
de_ch: Die folgenden Vorgabewerte können bei Bedarf angepasst werden.

source: cloning git repository '{repo}'
de_ch: Klone git-Repository «{repo}»

source: copying '{from}' to '{to}'
de_ch: Kopieren «{from}» nach «{to}»

source: error copying '{from}' to '{to}'
de_ch: Fehler beim Kopieren von «{from}» nach «{to}»

source: execute: {cmd}
de_ch: Ausführung: {cmd}

source: {command}: failed to execute: {error}
de_ch: {command}: Fehler beim Ausführen: {error}

source: {command}: died with signal {signo}
de_ch: {command}: terminiert durch Signal {signo}

source: {command}: terminated with exit code {code}
de_ch: {command}: beendet mit Exit-Code {code}

source: rename '{from}' to '{to}'
de_ch: Umbenennen von «{from}» in «{to}»

source: error renaming '{from}' to '{to}': {error}
de_ch: Fehler beim Umbenennen von «{from}» in «{to}»: {error}

source: error reading '{filename}': {error}
de_ch: Fehler beim Lesen von «{filename}»: {error}

source: default views directory is '/', please configure 'po.views'
de_ch: Standard-Views-Verzeichnis ist «/», bitte «po.views» konfigurieren!

source: removing template file '{filename}'
de_ch: Entfernen der Template-Datei '{filename}’

source: adding template file '{filename}'
de_ch: Template-Datei «{filename}» wird hinzugefügt

source: writing '{filename}'
de_ch: Schreiben von «{filename}»

source: unlink '{filename}'
de_ch: Löschen von «{filename}»

source: merging {filename}
de_ch: Zusammenführen von {filename}

source: Merging {filename} failed
de_ch: Fehler beim Zusammenführen von {filename}

source: create directory '{directory}'
de_ch: Verzeichnis «{directory}» erstellen

source: copy '{from}' to '{to}'
de_ch: Kopiere «{from}» nach «{to}»

source: cannot copy '{from}' to '{to}': {error}
de_ch: Kopie von «{from}» nach «{to}» kann nicht erstellt werden: {error}

source: can only read once from standard input
de_ch: von der Standardeingabe kann nur einmal gelesen werden

source: error instantiating processor '{processor}'.
de_ch: Fehler beim Instanziieren des Prozessors «{processor}».

source: [standard input]
de_ch: [Standard-Eingabe]

source: unable to open '{filename}' for reading: {error}!
de_ch: «{filename}» kann nicht zum Lesen nicht geöffnet werden: {error}!

source: Neither '_init.yaml' nor '_init.yml' found in repository, proceeding with defaults
de_ch: Weder «_init.yaml» noch «_init. yml» im Repository gefunden; fahre mit Vorgabewerten fort

source: Invalid task name '{name}'
de_ch: Ungültiger Task-Name «{name}»

source: Cannot load task runner '{name}': {error}
de_ch: Task-Runner «{name}» kann nicht geladen werden: {error}

source: IMPORTANT! The following external helper program will be automatically started by Qgoda:
de_ch: WICHTIG! Das folgende externe Helfer-Programm wird automatisch von Qgoda gestartet:

source: Please review the above list before you start qgoda!
de_ch: Bitte die obige Liste überprüfen, bevor Qgoda gestartet wird!

source: Running '{command}':
de_ch: Ausführen von «{command}»:

source: Running '{command}' failed: {error}
de_ch: Fehler beim Ausführen von «{command}»: {error}

source: Creating directory '{directory}.
de_ch: Verzeichnis «{directory}» wird erzeugt.

source: Error creating directory '{dir}': {error}!
de_ch: Fehler beim Erstellen des Verzeichnisses «{dir}»: {error}!

source: Not overwriting '{filename}'!
de_ch: «{filename}» wird nicht überschrieben

source: Initializing '{filename}'.
de_ch: «{filename}» wird initialisiert.

source: Cannot write '{filename}': {error}!
de_ch: Fehler beim Schreiben von «{filename}»: {error}

source: start building site
de_ch: Site-Generierung beginnt

source: cannot chdir to source directory '{dir}': {error}
de_ch: Fehler beim Erstellen des Verzeichnisses «{dir}»: {error}!

source: cannot write '{file}': {error}!
de_ch: «{file}» kann nicht geschrieben werden: {error}!

source: finished building site with one artefact
de_ch: Site mit einem Artefakt neu generiert

source: one artefact was changed and has been re-written
de_ch: ein Artefakt wurde geändert und wurde neu geschrieben

source: one stale artefact has been deleted
de_ch: ein nicht mehr aktueller Artefakt wurde gelöscht

source: Unsupported dump output format '{format}'.
de_ch: Nicht unterstütztes Dump-Ausgabeformat «{format}».

source: waiting for changes in '{dir}'
de_ch: warten auf Änderungen in «{dir}»

source: Environment variable '{variable}' ignored when running as root
de_ch: Umgebunsvariable «{variable}» wird ignoriert, wenn qgoda mit root-Rechten läuft

source: starting helper: {helper}
de_ch: starter Helferapplikation: {helper}

source: failure starting helper: {error}
de_ch: Fehler beim Starten der Helfer-Applikation: {error}

source: invalid processor name '{processor}'
de_ch: Unzulässiger Prozessorname «{processor}»

source: scanning source directory '{srcdir}'
de_ch: Durchsuche Quellverzeichnis «{srcdir}»

source: scanning output directory '{outdir}'
de_ch: Durchsuche Ausgabe-Verzeichnis «{outdir}»

source: {class} analyzing '{relpath}'
de_ch: {class} analysiert «{relpath}»

source: invalid analyzer name '{analyzer}'
de_ch: Unzulässier Analyzer-Name «{analyzer}»

source: pruning directory '{directory}'
de_ch: Verzeichnis «{directory}» wird gesäubert

source: cannot remove directory '{directory}': {error}
de_ch: Verzeichnis «{directory}» kann nicht entfernt werden: {error}!

source: pruning file '{file}'
de_ch: lösche Datei «{file}»

source: cannot remove file '{filename}': {error}
de_ch: Datei «{filename}» kann nicht entfernt werden: {error}

source: changed file '{filename}' is ignored
de_ch: geänderte Datei «{filename}» wird ignoriert

source: file '{filename}' has changed
de_ch: Datei «{filename}» wurde geändert

source: start rebuilding site because of file system change
de_ch: Neugenerierung der Site wegen Änderungen im Dateisystem

source: locating asset '/{relpath}'
de_ch: Auffinden von Asset «/{relpath}»

source: location '{location}'
de_ch: Position «{location}»

source: ignoring '{relpath}': not under version control
de_ch: ignoriere «{relpath}»: Nicht unter Versionskontrolle
